"""Текстові повідомлення для бота"""

# Головне меню
WELCOME_MESSAGE = "Вітаю! Я бот підтримки Bambu Lab Україна 🇺🇦\n\nОберіть, будь ласка, тему звернення:"

# Повідомлення про вибір розділу
BREAKDOWN_START = """Ви обрали розділ '🔧 Поломка'. Для початку діалогу потрібно надати деяку інформацію."""

QUALITY_START = "Ви обрали розділ '🖨 Якість друку'. Для початку діалогу потрібно надати деяку інформацію."
FAQ_START = "Ви обрали розділ '❓ Питання / Відповідь'.\n\nОберіть, будь ласка, тему:"

# FAQ повідомлення
FAQ_REPAIR_INFO = """Для надсилання до нас принтеру на ремонт, просимо дотримуватись наступних правил для виключення затримок при отриманні:

- надсилайте на ФОП Невєров А.Ю. на телефон 096 352 2952

- якщо вага до 30 кг - Дніпро, відділення НП 162
- якщо вага більше 30 кг - Дніпро, відділення НП 6
- оголошена вартість до 19 999 грн.

Будь-ласка разом з принтером опис проблеми за якою ви звертаєтесь"""

# Запити даних
REQUEST_ORDER = "🔢 Введіть номер вашого замовлення, за яким ви купували принтер"

REQUEST_NAME = "👤 Будь ласка, введіть ваше Ім'я і Прізвище"
REQUEST_PHONE = "📱 Введіть ваш номер телефону у форматі: +380XXXXXXXXX"
REQUEST_PRINTER_MODEL = "🖨 Оберіть серію вашого принтеру:"
REQUEST_ISSUE_DESCRIPTION = "✍️ Напишіть код поломки та опишіть проблему"
REQUEST_PHOTO = "📸 Надішліть фото або відео, які демонструють проблему (до 10 фото) або оберіть 'Далі'"

# Підтвердження
ORDER_CONFIRMED = "✅ Зафіксували номер замовлення: {}"
ORDER_NOT_FOUND = "✅ Зафіксували, що ви купували не у нас"
NAME_CONFIRMED = "✅ Зафіксували ваші дані: {} {}"
PHONE_CONFIRMED = "✅ Зафіксували номер телефону: {}"
MODEL_CONFIRMED = "✅ Зафіксували модель принтеру: {}"
ISSUE_CONFIRMED = "✅ Зафіксували опис проблеми"
PHOTO_ADDED = "✅ Фото додано ({}/10) Можете додати ще фото або натисніть 'Далі'"

# Помилки
PHONE_ERROR = "❌ Введіть будь ласка номер тільки у форматі +380XXXXXXXXX"
NAME_ERROR = "❌ Будь ласка, введіть і ім'я, і прізвище"

# Фінальні повідомлення
REVIEW_REQUEST = "📋 Перевірте дані вашої заявки:"
REQUEST_COMPLETED = """✅ Дякуємо! 
Вашу заявку прийнято. 

Приблизний термін оброки заявки - 2 робочих дні."""

